app/views/carts/show.html.erb

SELECT "cart_items".* FROM "cart_items"
---
  <tbody>
    <% CartItem.all.each do |list| %>