app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("created_at", "name", "price", "stock", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-04 07:06:23.848635"], ["name", "blood"], ["price", 1.0], ["stock", 1], ["updated_at", "2015-02-04 07:06:23.848635"]]